[ItemDefs.ID_MO_NewsEcho1:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="The latest edition of ''This Just In'' from Hyperion Truth Broadcasting."

[ItemDefs.ID_NewsECHO:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Latest edition of ''This Just In'' from the Hyperion Truth Network"
